# Everything Mine

1995/98

инсталляция 180x150x30 cм, фотография на ткани, стенная роспись, трафаретная печать

…в определённой ситуации жизнь вынуждает подводить промежуточные итоги. Репрессивная атмосфера и отсутствие перспективы вытесняют из привычной среды обитания. Ощущение надвигающейся катастрофы заставляет паковать вещи. Часть данной работы была использована для инсталляции «Go Home» 1995 года, когда я сфотографировал все свои личные вещи и напечатал на ткани с эффектом патины. Старое тряпьё старого медиа, реальность между фото и живописью. В 1998 осознавая необходимость покинуть страну я использовал эти фото в сочетании с напечатанным через трафарет на стене текстом «Всё моё», имеющим двойное прочтение, как документальное вещественное «всё» чем я владею и «всё» как весь мир, полный жизненных возможностей. Символически я запаковал все свои вещи и отправил их за границу, откуда они никогда не вернулись…как выясняется с этого года и я сам тоже.

::img-caption
#img
![whats-app-image-2025-08-14-at-21.54.55-1.jpeg](/whats-app-image-2025-08-14-at-21.54.55-1.jpeg)

#caption
adsdasdasdasdqw **aasdasdas**
::

![](/whats-app-image-2025-08-14-at-21.54.55-1.jpeg "«Belarusian avant-garde», галерея 'Amfilada', Щетин, Польша")
